{
    "diseases": [
      {
        "id": "1.2",
        "name": "โรคใบจุดสีน้ำตาลในมันฝรั่ง (Potato Early Blight)",
        "characteristics": "โรคใบจุดสีน้ำตาลในมันฝรั่งเกิดจากเชื้อรา Alternaria solani มักพบบนใบ ลำต้น และผลของพืช ลักษณะอาการเริ่มจากมีจุดสีน้ำตาลขนาดเล็กบนใบ จากนั้นจุดจะขยายใหญ่ขึ้นและมีวงแหวนรอบๆ ทำให้ใบแห้งเหี่ยว โรคนี้จะลดการเจริญเติบโตของพืชและลดผลผลิตของมันฝรั่ง",
        "causes": "เชื้อรา Alternaria solani เจริญเติบโตได้ดีในสภาพอากาศที่ชื้นและมีอุณหภูมิสูง การสะสมของเชื้อรานี้เกิดจากการปลูกพืชในพื้นที่เดียวกันเป็นเวลานาน หรือการเก็บเกี่ยวพืชที่มีการติดเชื้อ เชื้อราสามารถแพร่กระจายผ่านทางลม น้ำ หรือเครื่องมือเกษตร",
        "treatment": "การใช้สารเคมี: สามารถใช้ยาฆ่าเชื้อรา เช่น สารเคมีประเภท Mancozeb หรือ Chlorothalonil เพื่อควบคุมการแพร่ระบาด การจัดการน้ำ: ควบคุมการให้น้ำไม่ให้มากเกินไป และหลีกเลี่ยงการให้น้ำในช่วงเย็นหรือกลางคืน การหมุนเวียนพืช: หลีกเลี่ยงการปลูกมันฝรั่งในพื้นที่ที่เคยมีการระบาดของโรคใบจุดสีน้ำตาล โดยการปลูกพืชชนิดอื่นเพื่อลดการสะสมของเชื้อราในดิน การเลือกใช้พันธุ์ต้านทาน: การใช้พันธุ์มันฝรั่งที่มีความต้านทานต่อโรคใบจุดสีน้ำตาลจะช่วยลดความเสี่ยงในการเกิดโรค การเก็บเกี่ยวและการเก็บรักษาที่ดี: ควรเก็บเกี่ยวมันฝรั่งเมื่อครบกำหนดและหลีกเลี่ยงการทำให้พืชบาดเจ็บเพื่อลดความเสี่ยงในการติดเชื้อ"
      },
      {
        "id": "1.0",
        "name": "โรคแบคทีเรียในพริกหยวก (Pepper bell Bacterial spot)",
        "characteristics": "เกิดจากแบคทีเรีย Xanthomonas campestris pv. vesicatoria ซึ่งสามารถแพร่กระจายผ่านเมล็ดพืชที่ติดเชื้อ อุปกรณ์การเกษตรที่ปนเปื้อน น้ำที่กระเซ็น และฝน สภาพอากาศที่ร้อนและชื้นเป็นปัจจัยที่ทำให้โรคนี้แพร่ระบาดได้ดี",
        "causes": "มีจุดเล็ก ๆ ที่มีลักษณะเหมือนแผลชื้นบนใบ ซึ่งต่อมาจะกลายเป็นสีน้ำตาลหรือดำและมีวงแหวนสีเหลืองรอบ ๆ ผลที่ติดเชื้อจะมีจุดด่างดำหรือนูนเป็นแผล หากการติดเชื้อรุนแรง ใบพืชอาจร่วงและทำให้พืชอ่อนแอ ผลผลิตลดลง",
        "treatment": "การรักษาสามารถทำได้โดยการใช้สารป้องกันเชื้อแบคทีเรีย เช่น สารคอปเปอร์หลีกเลี่ยงการให้น้ำแบบพ่นฝอยที่ทำให้ใบเปียก ควรเลือกปลูกพันธุ์พืชที่ทนทานต่อโรค และทำความสะอาดเครื่องมือการเกษตรเป็นประจำ รวมถึงการกำจัดซากพืชที่ติดเชื้อเพื่อป้องกันการแพร่กระจายของโรค"
      },
      {
        "id": "0.5",
        "name": "หนอนกระทู้ (Armyworm)",
        "characteristics": "หนอนกระทู้เป็นศัตรูพืชที่มีลำตัวสีน้ำตาลหรือเขียว มีเส้นแถบขาวบนลำตัว มีลักษณะการกินใบพืชอย่างรวดเร็ว โดยเฉพาะในพืชตระกูลข้าวโพด ข้าว ถั่ว และพืชผักต่างๆ หนอนกระทู้เป็นตัวอ่อนของผีเสื้อกลางคืน เมื่อเติบโตเต็มที่จะเข้าดักแด้ในดินก่อนจะกลายเป็นผีเสื้อ วงจรชีวิตของหนอนกระทู้สั้น และสามารถแพร่พันธุ์ได้อย่างรวดเร็ว",
        "causes": "การระบาดของหนอนกระทู้เกิดจากสภาพอากาศที่อบอุ่นและมีความชื้นสูง พื้นที่ที่มีการปลูกพืชซ้ำซากเป็นแหล่งที่เอื้อต่อการเพิ่มจำนวนของหนอนกระทู้ การระบาดสามารถแพร่กระจายไปยังพื้นที่ใกล้เคียงได้อย่างรวดเร็วหากไม่มีการควบคุม",
        "treatment": "การใช้สารเคมี: สามารถใช้ยาฆ่าแมลงในการควบคุม เช่น สารเคมีประเภท Pyrethroids และสารเคมีออร์แกนิก เช่น Spinosad การใช้ศัตรูธรรมชาติ: ส่งเสริมการใช้ตัวห้ำหรือตัวเบียน เช่น แตนเบียนหรือแมลงที่กินหนอนกระทู้ การเก็บเกี่ยวหนอนด้วยมือ: หากพบหนอนกระทู้ในระยะแรก การเก็บด้วยมือเป็นวิธีหนึ่งในการควบคุมการระบาด การปลูกพืชหมุนเวียน: การเปลี่ยนพืชที่ปลูกในแปลงจะช่วยลดการสะสมของหนอนกระทู้ในดินและพืช การเฝ้าระวัง: ควรตรวจสอบแปลงพืชอย่างสม่ำเสมอเพื่อป้องกันการระบาดในระยะเริ่มต้น"
      },
      {
        "id": "0.4",
        "name": "เพลี้ยอ่อน (Aphids)",
        "characteristics": "เพลี้ยอ่อนเป็นแมลงศัตรูพืชขนาดเล็ก ลำตัวมีสีเขียว เหลือง ดำ หรือสีน้ำตาล เพลี้ยอ่อนมักอยู่รวมกันเป็นกลุ่มบริเวณใต้ใบพืช ยอดอ่อน หรือช่อดอก สามารถดูดกินน้ำเลี้ยงจากพืช ทำให้พืชมีลักษณะเหี่ยวเฉาและเจริญเติบโตช้า เพลี้ยอ่อนยังสามารถเป็นพาหะนำโรคไวรัสที่แพร่กระจายในพืชได้อย่างรวดเร็ว",
        "causes": "การระบาดของเพลี้ยอ่อนมักเกิดจากสภาพอากาศที่อบอุ่นและแห้งแล้ง การปลูกพืชชนิดเดียวกันเป็นเวลานานส่งเสริมการเพิ่มจำนวนของเพลี้ยอ่อน เพลี้ยอ่อนสามารถแพร่กระจายโดยลม แมลงอื่น ๆ หรือการเคลื่อนย้ายพืชที่ติดเชื้อ",
        "treatment": "การใช้สารเคมี: ใช้สารฆ่าแมลงที่ปลอดภัย เช่น น้ำมันพืช (horticultural oil) หรือสารสกัดจากพืช เช่น น้ำมันสะเดา การใช้ศัตรูธรรมชาติ: ส่งเสริมการใช้แมลงที่กินเพลี้ยอ่อน เช่น เต่าทองหรือตัวเบียน เช่น แตนเบียน การพ่นน้ำ: การพ่นน้ำแรง ๆ บนพืชช่วยกำจัดเพลี้ยอ่อนออกจากพืช การปลูกพืชหลากหลาย: การปลูกพืชหมุนเวียนหรือปลูกพืชชนิดต่าง ๆ เพื่อลดความเสี่ยงในการระบาด การเฝ้าระวัง: ควรตรวจสอบแปลงพืชอย่างสม่ำเสมอเพื่อป้องกันและควบคุมการระบาดในระยะเริ่มต้น"
      }
    ]
  }
  